package com.scu.weibobot.domain.consts;

public class BotInfoConst {

    public static final String[] PROVICE = {"北京", "天津", "河北", "山西", "内蒙古", "辽宁", "吉林",
            "黑龙江", "上海", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南",
            "广东", "广西", "海南", "重庆", "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "青海",
            "宁夏", "新疆", "台湾", "香港", "澳门"};


    public static final String[] BOT_LEVEL = {"N", "H", "VH"};

    public static final String[] INTERESTS = {"生活方式", "经济学", "运动", "互联网", "艺术", "阅读",
            "美食", "动漫", "汽车", "足球", "教育", "摄影", "历史", "文化", "旅行", "职业发展", "金融",
            "游戏", "篮球", "生物学", "物理学", "化学", "科技", "体育", "商业", "健康", "创业", "设计",
            "自然科学", "法律", "电影", "音乐", "投资"};

    public static final int[] CITY_NUM = {19, 21, 12, 12, 13, 15, 10, 14, 20, 14, 12, 18, 10, 10, 18,
            19, 18, 15, 22, 16, 16, 41, 22, 10, 17, 8, 11, 15, 9, 6, 16, 25, 20, 9};

    public static final String[] NICKNAME_SUFFIX = {"a", "b", "c", "d", "e","f", "g", "h", "i", "j", "k",
            "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "-", "_", "1",
            "2", "3", "4", "5", "6", "7", "8", "9", "0"};


}
